Reports/ДанныеДляКарточкиУчетаОрганизацииВВоенкомате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ДанныеДляКарточкиУчетаОрганизацииВВоенкомате</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсчислятьОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗаконаОТрудеРК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияПеремещенияПереводаВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВоинскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Военкомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВУС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Годность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГодностьКВоеннойСлужбе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУчетаВоеннообязанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабронированОрганизацией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВоинскиеЗвания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииУчетаВоеннообязанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеМобпредписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКомандыПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскойОбязанности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскомуУчету</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскомуУчету</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоставыВоеннослужащих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ГодностьКВоеннойСлужбе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ГодностьКВоеннойСлужбе</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Годен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоденКНестроевой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОтношениеКВоинскойОбязанности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскойОбязанности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоПризывник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Военнообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВоеннообязанный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДанныеДляКарточкиУчетаОрганизацииВВоенкомате/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Хранит список структурных единиц, по которым стоится отчет
Перем мСписокСтруктурныхЕдиниц Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки) Экспорт

    Если ТипЗнч(мСписокСтруктурныхЕдиниц) <> Тип("СписокЗначений") Тогда 
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	  
    СписокОфицерскихЗваний	=	Новый СписокЗначений;
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.МладшийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Лейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.СтаршийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Капитан);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Майор);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Подполковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Полковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералМайор);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералПолковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералАрмии);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.МаршалРеспубликиКазахстан);
	
	СписокЗванийПрапорщиков	=	Новый СписокЗначений;
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Прапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.СтаршийПрапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.МладшийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Сержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.СтаршийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Старшина);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.МастерСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Сержант1Класса);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Сержант2Класса);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Сержант3Класса);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.ШтабСержант);
	
	СписокСолдатскихЗваний	=	Новый СписокЗначений;
	СписокСолдатскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Рядовой);
	СписокСолдатскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Ефрейтор);
	
	СписокГодныеКСлужбе = Новый СписокЗначений;
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.Годен);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ГоденКНестроевой);
	
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организации",		мСписокСтруктурныхЕдиниц);
	Запрос.УстановитьПараметр("Офицеры",			СписокОфицерскихЗваний);
	Запрос.УстановитьПараметр("Прапорщики",			СписокЗванийПрапорщиков);
	Запрос.УстановитьПараметр("Солдаты",			СписокСолдатскихЗваний);
	Запрос.УстановитьПараметр("Военнообязанный",	Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	Запрос.УстановитьПараметр("СписокГодныеКСлужбе",СписокГодныеКСлужбе);
	
	Запрос.УстановитьПараметр("Призывник",			Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	Запрос.УстановитьПараметр("Уволен",				Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(1) КАК ВсегоРаботающих,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоВЗапасе,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И ВУ.Годность В (&СписокГодныеКСлужбе)
	|					И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОфицеровВЗапасе,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И ВУ.Годность В (&СписокГодныеКСлужбе)
	|					И ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПрапорщиковВЗапасе,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И ВУ.Годность В (&СписокГодныеКСлужбе)
	|					И ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СолдатВЗапасе,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И (НЕ ВУ.Годность В (&СписокГодныеКСлужбе))
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НегодныхВМирноеВремя,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ЗабронированОрганизацией В (&Организации)
	|					И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоВЗапасеЗабронировано,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ЗабронированОрганизацией В (&Организации)
	|					И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОфицеровЗабронировано,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ВУ.ЗабронированОрганизацией В (&Организации))
	|					И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И (НЕ ВУ.НаличиеМобпредписания)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НезабронированноБезМобпредписаний,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ ВУ.ЗабронированОрганизацией В (&Организации))
	|					И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный
	|					И ВУ.НаличиеМобпредписания
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НезабронированноСМобпредписанием,
	|	СУММА(ВЫБОР
	|			КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Призывник
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Призывников
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаАктуальности,
	|				Сотрудник.ВидЗанятости <> &ВнутреннееСовместительство) КАК РаботникиОрганизацииСрезПоследних
	|	ГДЕ
	|		РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение В (&Организации)
	|		И РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния <> &Уволен) КАК РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаАктуальности, ) КАК ВУ
	|		ПО РаботникиОрганизации.ФизЛицо = ВУ.Физлицо";

	РезультатЗапроса = Запрос.Выполнить();

	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("Карточка");

	ВыборкаПоКатегориям	=	РезультатЗапроса.Выбрать();
	Если ВыборкаПоКатегориям.Следующий() тогда
		ОбластьКарточка 	= Макет.ПолучитьОбласть("Карточка");
		ОбластьКарточка.Параметры.ВсегоРаботающих								= "ВСЕГО работающих  "	+	ВыборкаПоКатегориям.ВсегоРаботающих;
		ОбластьКарточка.Параметры.ВсегоВЗапасе 									= "12.1. Граждан, пребывающих в запасе (военнообязанных),  "	+	ВыборкаПоКатегориям.ВсегоВЗапасе;
		ОбластьКарточка.Параметры.ОфицеровВЗапасе 								= "а) офицеров и генералов  "	+	ВыборкаПоКатегориям.ОфицеровВЗапасе;
		ОбластьКарточка.Параметры.ПрапорщиковВЗапасе 							= "б) прапорщиков, мичманов, сержантов и старшин  "	+	ВыборкаПоКатегориям.ПрапорщиковВЗапасе;
		ОбластьКарточка.Параметры.СолдатВЗапасе 								= "в) солдат и матросов  "	+	ВыборкаПоКатегориям.СолдатВЗапасе;
		ОбластьКарточка.Параметры.НегодныхВМирноеВремя 	= "г) негодных к военной службе в мирное время  "	+	ВыборкаПоКатегориям.НегодныхВМирноеВремя;
		ОбластьКарточка.Параметры.ВсегоВЗапасеЗабронировано 					= "12.2. Забронировано всего:  " + ВыборкаПоКатегориям.ВсегоВЗапасеЗабронировано	+	", в том числе офицеров и генералов  " + ВыборкаПоКатегориям.ОфицеровЗабронировано;
		ОбластьКарточка.Параметры.НезабронированноБезМобпредписаний 			= "12.3. Незабронировано не имеющих мобпредписаний  "	+	ВыборкаПоКатегориям.НезабронированноБезМобпредписаний;
		ОбластьКарточка.Параметры.НезабронированноСМобпредписанием				= "12.4. Подлежит призыву по мобилизации  "	+	ВыборкаПоКатегориям.НезабронированноСМобпредписанием;
		ОбластьКарточка.Параметры.Призывников									= "12.5. Призывников  "	+	ВыборкаПоКатегориям.Призывников;
	КонецЕсли;
	Если ТипЗнч(ОбластьКарточка)	=	Тип("ТабличныйДокумент")	тогда
		ДокументРезультат.Вывести(ОбластьКарточка);
	КонецЕсли;
	
	//Параметры документа
	ДокументРезультат.Автомасштаб		 = Истина;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Защита             = Ложь;
	ДокументРезультат.ТолькоПросмотр     = Ложь;
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, "Данные для карточки учета организации в военкомате", Строка(глТекущийПользователь));
	
КонецПроцедуры

#КонецЕсли

мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
